修改mermaid等格式
